1s/ERP/Conf/Documents/Лико_ПодготовкаМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ПодготовкаМатериалов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Лико_МатериалыВРезерве</xr:Item>
				<xr:Item>InformationRegister.Лико_ПодготовленныеМатериалы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеМатериала</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриходаМатериала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроверкиНаличияМатериала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаменаМатериала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаменаНарезки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаменаДопМатериалов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПроката</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Нарезка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеМатериалыСтрокойЗамена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриходаМатериалаТекст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НарезкаЗамена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МатериалЗамена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнятиеРезерва</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьФормы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПечатиТребования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеСниматьРезервПослеЗакрытияБланка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Площадки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочийЦентр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Затрата</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПроката</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нарезка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеноваяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСекции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ВидыСекций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Резервирование</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нарезка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯССМ_Нарезки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПроката</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОжидаетсяПриход</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОжидаетсяПереработка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНастроечногоМатериала</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ВидыНастроечногоМатериала</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Авто</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Настройка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Печать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСекции</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ВидыСекций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/AccumulationRegisters/Лико_МатериалыВРезерве.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Лико_МатериалыВРезерве</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОжидаетсяПриход</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОжидаетсяПереработка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехнологическиеОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерПроката</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНастроечногоМатериала</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ВидыНастроечногоМатериала</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСекции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_ВидыСекций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ПодготовкаМатериалов/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения); 		
	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		
	КонецЕсли;	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 	
	Если Не ДополнительныеСвойства.Свойство("НеПроверятьЗаполнениеПолейНастройкаПечать") Тогда
		
		ПроверитьЗаполнениеПолейНастройкаПечать(Отказ); 
		
	КонецЕсли;
	
	
	//ПроверкаМатериаловТехнологом(отказ);
	
		
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	РабочийЦентр=ОпределитьРабочийЦентр();
	Если РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда 	
		ЕСли 	Резервирование.Количество()=0 и СнятиеРезерва Тогда
			СнятиеРезерва=Ложь;
		КонецЕсли;
	КонецЕсли;
	Если РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения Тогда
		//ДатаПриходаМатериала		=Неопределено;
		//ДатаПриходаМатериалаТекст	=Неопределено;
		//НаличиеМатериала			=Неопределено;
	КонецЕсли;
	
	ЗаказПоставщику=ПроверитьЕстьЗаказПоставщику();
	 //+ ---> Лико2.5 m.shenderov 30.03.2022
	ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	//- <--- Лико2.5 m.shenderov 30.03.2022 
	
	
	// --> Начало Лико Субботин 01.03.2023 	
	Если ЗначениеЗаполнено(ДатаПечатиТребования) Тогда
		
		Если ВернутьКонтрольныйХэш(Истина) <> ВернутьКонтрольныйХэш(Ложь) Тогда
			ДатаИзменения = ТекущаяДата();
		КонецЕсли;
	КонецЕсли;
    // <-- Конец Лико Субботин 01.03.2023 
	
	

	
КонецПроцедуры   

Функция ВернутьКонтрольныйХэш(ХэшССылки)
	
	СтруктураДляПроверки = новый Структура; 
	Если ХэшССылки Тогда
		СтруктураДляПроверки.Вставить("Резервирование", Ссылка.Резервирование.Выгрузить()); 
	иначе	
		СтруктураДляПроверки.Вставить("Резервирование", Резервирование.Выгрузить());
	КонецЕсли;  

	Возврат ОбщегоНазначения.КонтрольнаяСуммаСтрокой(СтруктураДляПроверки)

	
КонецФункции


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
		Если Отказ Тогда
		Возврат;
	КонецЕсли;


	
ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
СформироватьПодготовленныеМатериалы();
	
КонецПроцедуры

Процедура СтруктураПараметровЗаписиОбъекта() 	
	
	Если Не ДополнительныеСвойства.Свойство("ЕстьВопросыПередЗаписью") ТОгда
		ДополнительныеСвойства.Вставить("ЕстьВопросыПередЗаписью", Ложь);
	КонецЕсли;
	Если Не ДополнительныеСвойства.Свойство("НовыйОбъект") ТОгда
		ДополнительныеСвойства.Вставить("НовыйОбъект", Ложь); 		
	КонецЕсли;
	Если Не ДополнительныеСвойства.Свойство("ПринудительноЗакрытьФорму") ТОгда
		ДополнительныеСвойства.Вставить("ПринудительноЗакрытьФорму", Ложь); 		
	КонецЕсли;
	Если Не ДополнительныеСвойства.Свойство("РежимЗаписи") ТОгда
		ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписиДокумента.Запись);		
	КонецЕсли; 	
	Если Не ДополнительныеСвойства.Свойство("РежимПроведения") ТОгда
		ДополнительныеСвойства.Вставить("РежимПроведения", РежимПроведенияДокумента.Неоперативный); 	
	КонецЕсли;
	
Конецпроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	


	Если Отказ Тогда
		Возврат;
	КонецЕсли;   
	ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);

  	
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	
	
КонецПроцедуры

Процедура СформироватьПодготовленныеМатериалы() 
	
	НаборЗаписей = РегистрыСведений.Лико_ПодготовленныеМатериалы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	НоваяЗапись=НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяЗапись,Ссылка);
	НоваяЗапись.Регистратор=Ссылка;
	Если Не СнятиеРезерва и Резервирование.Итог("КоличествоУпаковок")>0 Тогда
		НоваяЗапись.Резерв=Истина;
	Иначе
		НоваяЗапись.Резерв=Ложь;
	КонецЕсли;
	Если ЗначениеЗаполнено(ЗаказПоставщику) И НЕ ЗначениеЗаполнено(ДатаПриходаМатериалаТекст) Тогда
		//НоваяЗапись.ДатаПриходаМатериалаТекст=Формат(ЗаказПоставщику.ДатаПервогоПоступления,"ДФ=dd.MM.yyyy");
		ДатаПоступленияЗаказа=?(ЗаказПоставщику.ПоступлениеОднойДатой,ЗаказПоставщику.ДатаПервогоПоступления,ЗаказПоставщику.ЖелаемаяДатаПоступления); 
		Если ЗначениеЗаполнено(ДатаПоступленияЗаказа) ТОгда
			
		НоваяЗапись.ДатаПриходаМатериалаТекст=Формат(ДатаПоступленияЗаказа,"ДФ=dd.MM.yyyy");
		КонецЕсли;
 
	Иначе
		НоваяЗапись.ДатаПриходаМатериалаТекст=ДатаПриходаМатериалаТекст;
	КонецЕсли;
	НоваяЗапись.ОсновнойМатериал		=ЗаполнитьМатериалСтрокой(Справочники.Лико_СтатьиЗатрат.ОсновнойМатериал);
	НоваяЗапись.ДополнительныМатериал	=ЗаполнитьМатериалСтрокой(Справочники.Лико_СтатьиЗатрат.ДополнительныеМатериалы);
	
	НаборЗаписей.Записать(Истина);		
КонецПроцедуры




#КонецОбласти

#Область ИнициализацияИЗаполнение

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)
	Если ТипЗнч(ДанныеЗаполнения)=Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
	КонецЕсли;
	
	
	Дата = ТекущаяДатаСеанса();
	Ответственный = Пользователи.ТекущийПользователь();
	АвторДокумента =Ответственный.ФизическоеЛицо;
	Структура = Новый Структура;
	Лико_ОбщегоНазначенияСервер.РеквизитыШапки(Структура);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект,Структура);
	Нарезка=ЗаказКлиента.Нарезка;
	Организация=ЗаказКлиента.Площадка.Организация;
	ЕстьФормы=ПроверитьЕстьФормы();
	ЗаполнитьТаблицуМатериалов();
	ПроверкаНаличеИндиго();  
	
	ДатаПечатиТребования = Неопределено;
	ДатаИзменения = неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область Прочее
Процедура СформироватьСписокРегистровДляКонтроля()
	
	
	
	Массив = Новый Массив;
	
	Если Не ДополнительныеСвойства.Свойство("ОтключитьКонтрольПриПроведении") Тогда
		Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			
			
		КонецЕсли;
	КонецЕсли;
	
	ДополнительныеСвойства.ДляПроведения.Вставить("РегистрыДляКонтроля", Массив);
	
	
	
КонецПроцедуры




Процедура ЗаполнитьТаблицуМатериалов()
	
	Запрос= Новый Запрос;
	Если  РабочийЦентр.ВидРабочегоЦентра=Справочники.ВидыРабочихЦентров.NewFoil тогда
		РАбочийЦентрПП=РабочийЦентрПервогоПроката();	
		Документы.Лико_ПодготовкаМатериалов.СформироватьЗапросПоМатериалуВЗаказеNF(Запрос);
		Запрос.УстановитьПараметр("ЗаказКлиента",ЗаказКлиента);
		Запрос.УстановитьПараметр("НомерПроката",НомерПроката);
		Запрос.УстановитьПараметр("РабочийЦентр",РАбочийЦентрПП); 
		Запрос.УстановитьПараметр("ВидРабочегоЦентра",РабочийЦентр.ВидРабочегоЦентра);

	Иначе
		// --> Начало Лико Ефимов ЕВВ 04.10.2024
		// Поменял организацию на РабочийЦентр.Лико_Площадка, чтобы правильно отрабатывало на заказах Ликофлекс на 300 машине 
		//BRC= УправлениеСвойствами.ЗначениеСвойства(Организация,"Лико_УчетНаСкладеПоBRC");
		BRC= УправлениеСвойствами.ЗначениеСвойства(РабочийЦентр.Лико_Площадка.Организация,"Лико_УчетНаСкладеПоBRC");
		// <-- Конец Лико Ефимов ЕВВ 04.10.2024
		BRC=?(ЗначениеЗаполнено(BRC),BRC,Ложь);
		Если BRC ТОгда
			Документы.Лико_ПодготовкаМатериалов.СформироватьЗапросПоМатериалуВЗаказеBRC(Запрос);
		Иначе 
			Если (РабочийЦентр.ВидРабочегоЦентра=Справочники.ВидыРабочихЦентров.Indigo Или РабочийЦентр.ВидРабочегоЦентра=Справочники.ВидыРабочихЦентров.Omega)  и
				Организация=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра Тогда
				Документы.Лико_ПодготовкаМатериалов.СформироватьЗапросПоМатериалуВЗаказеЦифраСПБ(Запрос);	
			Иначе 				
				Документы.Лико_ПодготовкаМатериалов.СформироватьЗапросПоМатериалуВЗаказе(Запрос);
			КонецЕсли;	
		КонецЕсли;

		Запрос.УстановитьПараметр("ЗаказКлиента",ЗаказКлиента);
		Запрос.УстановитьПараметр("НомерПроката",НомерПроката);
		Запрос.УстановитьПараметр("РабочийЦентр",РабочийЦентр);
		Запрос.УстановитьПараметр("ВидРабочегоЦентра",РабочийЦентр.ВидРабочегоЦентра);
	КонецЕсли;

	Материалы.Загрузить(Запрос.Выполнить().Выгрузить());

	Структура = Новый Структура;
	Структура.Вставить("СтатьяЗатрат",Справочники.Лико_СтатьиЗатрат.ДополнительныеМатериалы);
	ДопМатериалы="";
	//Для каждого Материал Из Материалы.НайтиСтроки(Структура) Цикл
	//	Если ЗначениеЗаполнено(ДопМатериалы) Тогда
	//		    ДопМатериалы=ДопМатериалы+" ";
	//		КонецЕсли;
	//	ДопМатериалы=ДопМатериалы+СокрЛП(Материал.Нарезка.Наименование)+" "+СокрЛП(Материал.Номенклатура.Наименование);
	//	
	//КонецЦикла;

	//ДополнительныеМатериалыСтрокой=ДопМатериалы;


КонецПроцедуры



Функция ПроверитьЕстьЗаказПоставщику() //+Лико m.shenderov 27/10/2019
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 1
	|	ЗаказПоставщикуЛико_РезервПодЗаказКлиента.Ссылка КАК Распоряжение
	|ИЗ
	|	Документ.ЗаказПоставщику.Лико_РезервПодЗаказКлиента КАК ЗаказПоставщикуЛико_РезервПодЗаказКлиента
	|ГДЕ
	|	ЗаказПоставщикуЛико_РезервПодЗаказКлиента.ЗаказКлиента = &ЗаказКлиента
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗаказПоставщикуЛико_РезервПодЗаказКлиента.Ссылка.ДатаПервогоПоступления УБЫВ";
	Запрос.УстановитьПараметр("ЗаказКлиента",ЗаказКлиента);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Возврат  Выборка.Распоряжение;
		
	КонецЦикла; 
	
	
	
КонецФункции //-Лико m.shenderov 27/10/2019 


Функция ОпределитьРабочийЦентр140120() //+Лико m.shenderov 08.02.2018
	РЦ =Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПооперационноеРасписание2_2.РабочийЦентр КАК РабочийЦентр
	|ИЗ
	|	РегистрСведений.ПооперационноеРасписание2_2 КАК ПооперационноеРасписание2_2
	|ГДЕ
	|	ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование = &Заказ
	|	И ПооперационноеРасписание2_2.Этап.НомерПроката = &НомерПроката";
	Запрос.УстановитьПараметр("Заказ",ЗаказКлиента );
	Запрос.УстановитьПараметр("НомерПроката",НомерПроката );
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Рц=Выборка.РабочийЦентр;
		
	КонецЦикла; 
	
	Возврат РЦ;
	
КонецФункции //-Лико m.shenderov 08.02.2018 


Функция ОпределитьРабочийЦентр()
	РЦ =Неопределено;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПооперационноеРасписание2_2.РабочийЦентр КАК РабочийЦентр
	|ИЗ
	|	РегистрСведений.ПооперационноеРасписание2_2 КАК ПооперационноеРасписание2_2
	|ГДЕ
	|	ПооперационноеРасписание2_2.Этап.Лико_ЗаказКлиента = &Заказ
	|	И ПооперационноеРасписание2_2.Этап.НомерПроката = &НомерПроката
	|	И НЕ ПооперационноеРасписание2_2.Моделирование";
	Запрос.УстановитьПараметр("Заказ",ЗаказКлиента );
	Запрос.УстановитьПараметр("НомерПроката",НомерПроката );
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		РЦ =  Выборка.РабочийЦентр;
		
		Прервать;
		
	КонецЦикла; 
	
	Возврат РЦ;
	
	
КонецФункции




Функция РабочийЦентрПервогоПроката() //+Лико m.shenderov 24.05.2018
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПооперационноеРасписание2_2.РабочийЦентр КАК РабочийЦентр
	|ИЗ
	|	РегистрСведений.ПооперационноеРасписание2_2 КАК ПооперационноеРасписание2_2
	|ГДЕ
	|	ПооперационноеРасписание2_2.Этап.Распоряжение.ДокументОснование = &Заказ
	|	И ПооперационноеРасписание2_2.Этап.НомерПроката = 1";
	Запрос.УстановитьПараметр("Заказ",ЗаказКлиента );
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.РабочийЦентр;
	КонецЦикла; 
	
	
	
	
КонецФункции //-Лико m.shenderov 24.05.2018 

Функция ПроверитьЕстьФормы() //+Лико m.shenderov 25.05.2018
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПодготовкаМатериалов.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Лико_ПодготовкаМатериалов КАК Лико_ПодготовкаМатериалов
	|ГДЕ
	|	Лико_ПодготовкаМатериалов.ЗаказКлиента = &ЗаказКлиента
	|	И Лико_ПодготовкаМатериалов.Проведен
	|	И Лико_ПодготовкаМатериалов.ЕстьФормы";
	Запрос.УстановитьПараметр("ЗаказКлиента",ЗаказКлиента);
	Возврат НЕ Запрос.Выполнить().Пустой();
	
	
КонецФункции //-Лико m.shenderov 25.05.2018 

Процедура ПроверкаНаличеИндиго() //+Лико m.shenderov 20.06.2018
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Лико_ПодготовкаМатериалов.НаличиеМатериала КАК НаличиеМатериала,
	|	Лико_ПодготовкаМатериалов.ДатаПриходаМатериала КАК ДатаПриходаМатериала
	|ИЗ
	|	Документ.Лико_ПодготовкаМатериалов КАК Лико_ПодготовкаМатериалов
	|ГДЕ
	|	Лико_ПодготовкаМатериалов.ЗаказКлиента = &ЗаказКлиента
	|	И Лико_ПодготовкаМатериалов.Проведен
	|	И Лико_ПодготовкаМатериалов.Ссылка <> &Ссылка
	|	И Лико_ПодготовкаМатериалов.РабочийЦентр.ВидРабочегоЦентра = &ВидРабочегоЦентра";
	Запрос.УстановитьПараметр("ЗаказКлиента",ЗаказКлиента);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("ВидРабочегоЦентра",Справочники.ВидыРабочихЦентров.Indigo);
	РезультатЗапроса=Запрос.Выполнить();
	Выборка =РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НаличиеМатериала			=Выборка.НаличиеМатериала;
		ДатаПриходаМатериала		=Выборка.ДатаПриходаМатериала;
		
	КонецЦикла; 
	
	
	
	
КонецПроцедуры //-Лико m.shenderov 20.06.2018

Функция ЗаполнитьМатериалСтрокой(СтатьяЗатрат)
	МатериалСтрокой="";
	//СтатьяЗатрат=Справочники.Лико_СтатьиЗатрат.ОсновнойМатериал;
	Номенклатуры=Резервирование.Выгрузить();
	Номенклатуры.Свернуть("Номенклатура");
	НетРезерва=Истина; 	
	Для каждого СтрНоменклатура Из Номенклатуры Цикл
		Структура = Новый Структура;
		Структура.Вставить("Номенклатура",СтрНоменклатура.Номенклатура);
		Структура.Вставить("СтатьяЗатрат",СтатьяЗатрат);
		СтрокиРезервирование=Резервирование.НайтиСтроки(Структура);
		Если  СтрокиРезервирование.Количество()>0 Тогда
			НетРезерва=Ложь; 			
			МатериалСтрокой=МатериалСтрокой+СтрНоменклатура.Номенклатура.Наименование+ " ("; 			
			н=0;
			Для каждого СтрРезерв  Из СтрокиРезервирование Цикл
				н=н+1;	
				МатериалСтрокой=МатериалСтрокой+?(н>1,", ","")+СтрРезерв.Нарезка.Наименование;
				Если н=СтрокиРезервирование.Количество()Тогда
					МатериалСтрокой=МатериалСтрокой+")";	
				КонецЕсли;				
			КонецЦикла;			
			МатериалСтрокой=МатериалСтрокой+"; ";			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НетРезерва Тогда 	
		
		Номенклатуры=Материалы.Выгрузить();
		Номенклатуры.Свернуть("ЦеноваяГруппа");
		
		Для каждого СтрЦеноваяГруппа Из Номенклатуры Цикл
			Структура = Новый Структура;
			Структура.Вставить("ЦеноваяГруппа",СтрЦеноваяГруппа.ЦеноваяГруппа);
			Структура.Вставить("СтатьяЗатрат",СтатьяЗатрат);
			СтрокиНоменклатура=Материалы.НайтиСтроки(Структура);
			Если  СтрокиНоменклатура.Количество()>0 Тогда
				
				МатериалСтрокой=МатериалСтрокой+СтрЦеноваяГруппа.ЦеноваяГруппа.Наименование+ " ("; 			
				н=0;
				Для каждого СтрНоменклатура  Из СтрокиНоменклатура Цикл
					н=н+1;	
					МатериалСтрокой=МатериалСтрокой+?(н>1,", ","")+СтрНоменклатура.Нарезка.Наименование;
					Если н=СтрокиНоменклатура.Количество()Тогда
						МатериалСтрокой=МатериалСтрокой+") ";	
					КонецЕсли;				
				КонецЦикла;			
				МатериалСтрокой=МатериалСтрокой+", ";	
			КонецЕсли; 		
			
		КонецЦикла;
		
		
		
		
		
	КонецЕсли;
	
	Возврат ?(ЗначениеЗаполнено(МатериалСтрокой),Лев(МатериалСтрокой,СтрДлина(МатериалСтрокой)-2),"");	
	
	
	
	
	
КонецФункции


Процедура ПроверитьЗаполнениеПолейНастройкаПечать300920(Отказ) //+Лико m.shenderov 20.05.2020
	Если Дата>Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаКонтроляЗаполненияПолейПечатьНастройкаВПодготовке.ЗначениеПараметра Тогда
		Если Организация=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра и Не ЗаказКлиента.Цифровой Тогда
			
			
			
			Нпор=0;
			ОшибкаДанных=Ложь;
			Для каждого Резерв Из Резервирование Цикл		
				Если Не Резерв.Настройка и Не Резерв.Печать Тогда		
					НомерСтроки=Нпор;			
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "У номенклатуры: "+Резерв.Номенклатура+" "+Резерв.Характеристика+" "+" не заполнен вид использования: настройка или печать.";
					Сообщение.Поле = "Резервирование["+Нпор+"].Печать"; //имя реквизита 
					Сообщение.КлючДанных = Ссылка;
					Сообщение.ПутьКДанным = "Объект";
					Сообщение.Сообщить();
					ОтменаРедактирования=Истина;
					Отказ=Истина;			
				КонецЕсли;
				Нпор=Нпор+1;			
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //-Лико m.shenderov 20.05.2020



Процедура ПроверитьЗаполнениеПолейНастройкаПечать080621(Отказ)
	Если Дата>Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаКонтроляЗаполненияПолейПечатьНастройкаВПодготовке.ЗначениеПараметра Тогда
		Если Организация=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра и Не ЗаказКлиента.Цифровой Тогда
			
			
			
			Нпор=0;
			ОшибкаДанных=Ложь;
			Для каждого Резерв Из Резервирование Цикл
				Если Резерв.ОжидаетсяПереработка и Резерв.ОжидаетсяПриход Тогда
					Резерв.ОжидаетсяПереработка=Ложь;
					Резерв.ОжидаетсяПриход=Ложь;
					Продолжить;
				КонецЕсли;
				
				Если Не Резерв.Настройка и Не Резерв.Печать Тогда		
					НомерСтроки=Нпор;			
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "У номенклатуры: "+Резерв.Номенклатура+" "+Резерв.Характеристика+" "+" не заполнен вид использования: настройка или печать.";
					Сообщение.Поле = "Резервирование["+Нпор+"].Печать"; //имя реквизита 
					Сообщение.КлючДанных = Ссылка;
					Сообщение.ПутьКДанным = "Объект";
					Сообщение.Сообщить();
					ОтменаРедактирования=Истина;
					Отказ=Истина;			
				КонецЕсли;
				Нпор=Нпор+1;			
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


Процедура ПроверитьЗаполнениеПолейНастройкаПечать(Отказ)
	Если Организация=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра и 
		(РабочийЦентр.ВидРабочегоЦентра=Справочники.ВидыРабочихЦентров.Indigo Или РабочийЦентр.ВидРабочегоЦентра=Справочники.ВидыРабочихЦентров.Omega) Тогда
		Для каждого Резерв Из Резервирование Цикл
			Если Резерв.Настройка Тогда
			//Резерв.Печать =Ложь;
		Иначе
			Резерв.Печать =Истина;

			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	

	
	Если Дата>Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаКонтроляЗаполненияПолейПечатьНастройкаВПодготовке.ЗначениеПараметра Тогда
		// --> Начало Лико Ефимов ЕВВ 04.10.2024
		// Поменял организацию на РабочийЦентр.Лико_Площадка, чтобы правильно отрабатывало на заказах Ликофлекс на 300 машине 
		//Если Организация=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра и Не РабочийЦентр.ВидРабочегоЦентра=Справочники.ВидыРабочихЦентров.Indigo Тогда
		Если РабочийЦентр.Лико_Площадка.Организация=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра и Не РабочийЦентр.ВидРабочегоЦентра=Справочники.ВидыРабочихЦентров.Indigo Тогда
        // <-- Конец Лико Ефимов ЕВВ 04.10.2024

			Нпор=0;
			ОшибкаДанных=Ложь;
			Для каждого Резерв Из Резервирование Цикл
				Если Резерв.ОжидаетсяПереработка и Резерв.ОжидаетсяПриход Тогда
					Резерв.ОжидаетсяПереработка=Ложь;
					Резерв.ОжидаетсяПриход=Ложь;
					Продолжить;
				КонецЕсли;

				Если Не Резерв.Настройка и Не Резерв.Печать Тогда		
					НомерСтроки=Нпор;			
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "У номенклатуры: "+Резерв.Номенклатура+" "+Резерв.Характеристика+" "+" не заполнен вид использования: настройка или печать.";
					Сообщение.Поле = "Резервирование["+Нпор+"].Печать"; //имя реквизита 
					Сообщение.КлючДанных = Ссылка;
					Сообщение.ПутьКДанным = "Объект";
					Сообщение.Сообщить();
					ОтменаРедактирования=Истина;
					Отказ=Истина;			
				КонецЕсли;
				Нпор=Нпор+1;			
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

 Процедура ПроверкаМатериаловТехнологом(Отказ) //+Лико m.shenderov 30.06.2022
	 ДатаНачалаПроверкиТехнологомМатериала=Справочники.Лико_ПредопределенныеЗначения.ДатаНачалаПроверкиТехнологомМатериала.ЗначениеПараметра;
	 ДатаКонтроля= ?(ЗначениеЗаполнено(Дата),Дата,ТекущаяДата());
	 ОрганизацияЛикофлекс=Справочники.Лико_ПредопределенныеЗначения.ОрганизацияЛикофлекс.ЗначениеПараметра;

	 
	 Если Организация=ОрганизацияЛикофлекс И
		 ЗначениеЗаполнено(ДатаНачалаПроверкиТехнологомМатериала) И
		 ДатаКонтроля>ДатаНачалаПроверкиТехнологомМатериала Тогда
	 Иначе
		 Возврат;
	 КонецЕсли;
	
	МассивНепровереннойНоменклатуры = Новый Массив;
	
	ТзСсылкаРезерв=Ссылка.Резервирование.Выгрузить();
	
	Для каждого Резерв Из Резервирование Цикл
		
		Если Не НоменклатураПроверенаТехнологом(Резерв.Номенклатура)  И   
			ТзСсылкаРезерв.Найти(Резерв.Номенклатура,"Номенклатура")=Неопределено Тогда 
			МассивНепровереннойНоменклатуры.Добавить(Резерв.Номенклатура);
		КонецЕсли;		
	КонецЦикла;
	
	Если МассивНепровереннойНоменклатуры.Количество()>0 Тогда
	//Отказ=Истина;
	ПроверкаМатериаловТехнологомОтправитьПисьмо(МассивНепровереннойНоменклатуры);
	КонецЕсли;   		
 КонецПроцедуры //-Лико m.shenderov 30.06.2022
 
 Функция НоменклатураПроверенаТехнологом(лНоменклатура) //+Лико m.shenderov 17.03.2022
	//Номенклатура=Справочники.Номенклатура.СоздатьЭлемент();
	лВидНоменклатуры= лНоменклатура.ВидНоменклатуры;
	Если лВидНоменклатуры.Лико_РулонныйМатериал И 
		лВидНоменклатуры<>Справочники.Лико_ПредопределенныеЗначения.ВидНоменклатурыНезавершеннаяПродукция.ЗначениеПараметра Тогда
		Возврат ЗначениеЗаполнено(лНоменклатура.Лико_ПроверенТехнологом);
	КонецЕсли;	
	Возврат Истина;
КонецФункции  //-Лико m.shenderov 17.03.2022

 Процедура ПроверкаМатериаловТехнологомОтправитьПисьмо(МассивМатериалов) //+Лико m.shenderov 30.06.2022	
 
 УстановитьПривилегированныйРежим(Истина);	
	  //Материал такой-то используется в производстве и не проверен
	Текст =  "Материал используется в производстве и не проверен";
	Тема  = Текст;  		
	Для каждого Товар  Из МассивМатериалов  Цикл
		Текст=Текст+Символы.ПС+Символы.ВК;
		Текст=Текст+Товар.Код+" "+Товар;			
	КонецЦикла;	
	Текст=Текст+Символы.ПС+Символы.ВК;
	Адресат = Справочники.Лико_ТипыСообщений.ПолучитьПочтовыеАдреса(Справочники.Лико_ТипыСообщений.ПроверкаМатериаловТехнологом,Организация);
	Если ЗначениеЗаполнено(Адресат) Тогда 
		Лико_Планирование.ОтправитьПисьмо(Текст, Тема, Адресат,,"textBody");  		
	КонецЕсли;
 КонецПроцедуры //-Лико m.shenderov 30.06.2022
	
#КонецОбласти

#Область ДвижениеяДокумента
Процедура ОтразитьЛико_МатериалыВРезерве(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	Таблица_Лико_МатериалыВРезерве = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЛико_МатериалыВРезерве;
	
	Если Отказ ИЛИ Таблица_Лико_МатериалыВРезерве.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Лико_МатериалыВРезерве = Движения.Лико_МатериалыВРезерве;
	Лико_МатериалыВРезерве.Записывать = Истина;
	Лико_МатериалыВРезерве.Загрузить(Таблица_Лико_МатериалыВРезерве);
	
КонецПроцедуры

//+ ---> Лико2.5 m.shenderov 31.03.2022 
Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	

	ПроведениеДокументов.ПриЗаписиДокумента(ЭтотОбъект, Отказ);
КонецПроцедуры 
//- <--- Лико2.5 m.shenderov 31.03.2022

#КонецОбласти
